1s/ERP/Conf/Documents/Лико_ЗаданиеНаОтборРазмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаданиеНаОтборРазмещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСкладскихЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресТранзит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаданийСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриПодборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ФормированиеПаллета2_0</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКудаФакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПаллетыВСекциях</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СкладскиеСекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыЗаданийСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыЗаданийСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТранзите</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыСкладскихЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыСкладскихЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Размещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаданиеНаОтборРазмещение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Площадка =АдресКуда.Лико_Площадка;
	Организация=АдресКуда.Лико_Организация;
	Склад=АдресКуда.Владелец;
	
	
	Если РежимЗаписи =РежимЗаписиДокумента.Проведение   Тогда
		
		Если Не ЗначениеЗаполнено(Статус) Тогда 
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое; 
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(АдресТранзит)
			И Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое Тогда
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите; 
			
			
		КонецЕсли;
		
		ЕСли  ЗначениеЗаполнено(АдресКудаФакт) И (Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
			Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите) Тогда 
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.Выполнено; 
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	
	Если РежимЗаписи =РежимЗаписиДокумента.Проведение
		И (Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
		Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите) Тогда 
		
		УчитыватьПриПодборе = Истина;
		
	Иначе
		
		УчитыватьПриПодборе = Ложь;
		
	КонецЕсли;
	
	
	Если  ЗначениеЗаполнено(АдресОткуда.Лико_Секция) И  ЗначениеЗаполнено(АдресКуда.Лико_Секция) Тогда
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Перемещение;
	ИначеЕсли  Не ЗначениеЗаполнено(АдресОткуда.Лико_Секция) И  ЗначениеЗаполнено(АдресКуда.Лико_Секция)ТОгда
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Размещение;
	Иначе
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Отбор;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) 
		И Не ЗначениеЗаполнено(АвторДокумента) Тогда
		
		АвторДокумента = ДокументОснование.АвторДокумента;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если РежимПроведения=РежимПроведенияДокумента.Оперативный Тогда
		
		Если Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
			Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите Тогда
			
			Документы.Лико_ЗаданиеНаОтборРазмещение.ОтменитьСтарыеЗадания(Паллет,Ссылка);
			
		КонецЕсли;
		
		
				
		
	КонецЕсли;
	
	СформироватьДвиженияПаллетыВСекциях();

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
	Статус=Неопределено;
	АвторДокумента=Неопределено;
	УчитыватьПриПодборе=Неопределено;	
	ДокументОснование=Неопределено;
	АдресКудаФакт=Неопределено;
	ДокументПеремещения=Неопределено;
	
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура СформироватьДвиженияПаллетыВСекциях()
    Движения.Лико_ПаллетыВСекциях.Записывать = Истина;
	Если УчитыватьПриПодборе И ЗначениеЗаполнено(АдресКуда.Лико_Секция) Тогда
		
		
		// Регистрация паллеты в новом адресе
		
		ДвижениеСекции = Движения.Лико_ПаллетыВСекциях.ДобавитьПриход();
		ДвижениеСекции.Период = Дата;
		ДвижениеСекции.Паллет = Паллет;
		ДвижениеСекции.Адрес = АдресКуда;
		ДвижениеСекции.Секция = АдресКуда.Лико_Секция;
		ДвижениеСекции.Количество = 0;
		ДвижениеСекции.Заблокирован = 1; 
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	   УровеньДоступа=1;
КонецПроцедуры


#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
|en = 'Invalid object call on the client.'");
#КонецЕсли
